zophai-liu/rtk-zephyr/drivers/usb/device/usb_dc_rtl87x2g.c
/*
 * Copyright(c) 2020, Realtek Semiconductor Corporation.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT realtek_rtl87x2g_usb

#include <string.h>
#include <stdio.h>

#include <zephyr/kernel.h>
#include <zephyr/devicetree.h>
#include <zephyr/irq.h>
#include <zephyr/sys/util.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/usb/usb_device.h>
#include <zephyr/drivers/usb/usb_dc.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/bee_clock_control.h>

#include <usb_dwc2_hw.h>

#include "rtl876x.h"
#include <soc.h>

#include "usb_dc_rtl87x2g.h"

#ifdef CONFIG_PM
#include "power_manager_unit_platform.h"
#endif

#include "trace.h"

#include <zephyr/logging/log.h>
#define LOG_LEVEL CONFIG_USB_DRIVER_LOG_LEVEL
LOG_MODULE_REGISTER(usb_rtl87x2g, 0);

#define DBG_DIRECT_SHOW 0

/* FIXME: The actual number of endpoints should be obtained from GHWCFG4. */
enum usb_dwc2_in_ep_idx {
	USB_DWC2_IN_EP_0 = 0,
	USB_DWC2_IN_EP_1,
	USB_DWC2_IN_EP_2,
	USB_DWC2_IN_EP_3,
	USB_DWC2_IN_EP_4,
	USB_DWC2_IN_EP_5,
	USB_DWC2_IN_EP_NUM
};

/* FIXME: The actual number of endpoints should be obtained from GHWCFG2. */
enum usb_dwc2_out_ep_idx {
	USB_DWC2_OUT_EP_0 = 0,
	USB_DWC2_OUT_EP_1,
	USB_DWC2_OUT_EP_2,
	USB_DWC2_OUT_EP_3,
	USB_DWC2_OUT_EP_4,
	USB_DWC2_OUT_EP_5,
	USB_DWC2_OUT_EP_NUM
};

#if CONFIG_USB_DC_RTL87X2G_DMA
K_HEAP_DEFINE(ep_heap, CONFIG_USB_EP_HEAP_SIZE);

#endif

#define USB_DWC2_CORE_RST_TIMEOUT_US 10000

/* FIXME: The actual MPS depends on endpoint type and bus speed. */
#define DW_USB_MAX_PACKET_SIZE 64

/* Number of SETUP back-to-back packets */
#define USB_DWC2_SUP_CNT 1

/* Get Data FIFO access register */
#define USB_DWC2_EP_FIFO(base, idx) (*(uint32_t *)(POINTER_TO_UINT(base) + 0x1000 * (idx + 1)))

#define USB_DWC2_EP_TX_FIFO(base, idx) USB_DWC2_EP_FIFO(base, idx)

volatile static bool usb_power_is_on = false;
struct usb_dwc2_config {
	struct usb_dwc2_reg *const base;
	void (*irq_enable_func)(const struct device *dev);
	int (*pwr_on_func)(const struct device *dev);
};

/*
 * USB endpoint private structure.
 */
struct usb_ep_ctrl_prv {
	uint8_t ep_ena;
	uint8_t fifo_num;
	uint32_t fifo_size;
	uint16_t mps;          /* Max ep pkt size */
	usb_dc_ep_callback cb; /* Endpoint callback function */
	uint32_t data_len;
	uint32_t rsvd_tx_len;
	const uint8_t *rsvd_tx_buf;
};

static void usb_dwc2_isr_handler(const void *unused);

/*
 * USB controller private structure.
 */
struct usb_dwc2_ctrl_prv {
#if CONFIG_USB_DC_RTL87X2G_DMA
	OutDmaDesc_t *volatile aOutDmaDesc[USB_DWC2_OUT_EP_NUM];
	InDmaDesc_t *volatile aInDmaDesc[USB_DWC2_IN_EP_NUM];
	inxfer_t *aInXfer[USB_DWC2_IN_EP_NUM];
	outxfer_t *aOutXfer[USB_DWC2_OUT_EP_NUM];
	uint8_t *ep_rx_buf[USB_DWC2_OUT_EP_NUM];
#endif
	usb_dc_status_callback status_cb;
	enum usb_dc_status_code current_status;
	struct usb_ep_ctrl_prv in_ep_ctrl[USB_DWC2_IN_EP_NUM];
	struct usb_ep_ctrl_prv out_ep_ctrl[USB_DWC2_OUT_EP_NUM];
	uint8_t attached;
};

static const uint16_t kaTxFifoBytesTable[] = {
	CONFIG_USB_DC_RTL87X2G_EP0_TX_FIFO_SIZE, CONFIG_USB_DC_RTL87X2G_EP1_TX_FIFO_SIZE,
	CONFIG_USB_DC_RTL87X2G_EP2_TX_FIFO_SIZE, CONFIG_USB_DC_RTL87X2G_EP3_TX_FIFO_SIZE,
	CONFIG_USB_DC_RTL87X2G_EP4_TX_FIFO_SIZE, CONFIG_USB_DC_RTL87X2G_EP5_TX_FIFO_SIZE};

static uint32_t kaTxFifoAddrTable[6];

#define TX_FIFO_SIZE(epidx) (kaTxFifoBytesTable[epidx] / 4)

static void usb_dwc2_isr_handler(const void *unused);
static void usb_dwc2_resume_isr_handler(const void *unused);
static void usb_isr_suspend_enable(void);
extern int hal_usb_phy_power_on(void);
extern int32_t usb_rtk_resume_sequence(void);
extern void usb_rtk_disable_power_seq(void);

#define USB_DWC2_DEVICE_DEFINE(n)                                                                  \
                                                                                                   \
	static void usb_dwc2_irq_enable_func_##n(const struct device *dev)                         \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQ_BY_IDX(0, 0, irq), DT_INST_IRQ_BY_IDX(0, 0, priority),     \
			    usb_dwc2_isr_handler, 0, 0);                                           \
		IRQ_CONNECT(DT_INST_IRQ_BY_IDX(0, 1, irq), DT_INST_IRQ_BY_IDX(0, 1, priority),     \
			    usb_dwc2_resume_isr_handler, 0, 0);                                    \
		irq_enable(DT_INST_IRQ_BY_IDX(0, 0, irq));                                         \
		irq_enable(DT_INST_IRQ_BY_IDX(0, 1, irq));                                         \
		usb_isr_suspend_enable();                                                          \
	}                                                                                          \
	static int usb_rtl87x2g_pwr_on_func##n(const struct device *dev)                           \
	{                                                                                          \
		return hal_usb_phy_power_on();                                                     \
	}                                                                                          \
	static const struct usb_dwc2_config usb_dwc2_cfg_##n = {                                   \
		.base = (struct usb_dwc2_reg *)DT_INST_REG_ADDR(n),                                \
		.irq_enable_func = usb_dwc2_irq_enable_func_##n,                                   \
		.pwr_on_func = usb_rtl87x2g_pwr_on_func##n,                                        \
	};                                                                                         \
                                                                                                   \
	static struct usb_dwc2_ctrl_prv usb_dwc2_ctrl_##n;

USB_DWC2_DEVICE_DEFINE(0)

#define usb_dwc2_ctrl usb_dwc2_ctrl_0
#define usb_dwc2_cfg  usb_dwc2_cfg_0

typedef union grstctl_data {
	uint32_t d32;
	struct {
		unsigned csftrst: 1;
		unsigned hsftrst: 1;
		unsigned hstfrm: 1;
		unsigned intknqflsh: 1;
		unsigned rxfflsh: 1;
		unsigned txfflsh: 1;
		unsigned txfnum: 5;
		unsigned reserved11_28: 18;
		unsigned CSftRstDone: 1;
		unsigned dmareq: 1;
		unsigned ahbidle: 1;
	} b;
} grstctl_t;

static uint8_t usb_dwc2_ep_is_valid(uint8_t ep)
{
	uint8_t ep_idx = USB_EP_GET_IDX(ep);

