zophai-liu/rtk-zephyr/drivers/usb/device/usb_dc_rtl87x2g.c
	/* Check if ep enabled */
	if ((USB_EP_DIR_IS_OUT(ep)) && ep_idx < USB_DWC2_OUT_EP_NUM) {
		return 1;
	} else if ((USB_EP_DIR_IS_IN(ep)) && ep_idx < USB_DWC2_IN_EP_NUM) {
		return 1;
	}

	return 0;
}

static uint8_t usb_dwc2_ep_is_enabled(uint8_t ep)
{
	uint8_t ep_idx = USB_EP_GET_IDX(ep);

	/* Check if ep enabled */
	if ((USB_EP_DIR_IS_OUT(ep)) && usb_dwc2_ctrl.out_ep_ctrl[ep_idx].ep_ena) {
		return 1;
	} else if ((USB_EP_DIR_IS_IN(ep)) && usb_dwc2_ctrl.in_ep_ctrl[ep_idx].ep_ena) {
		return 1;
	}

	return 0;
}

static inline void usb_dwc2_udelay(uint32_t us)
{
	k_busy_wait(us);
}

static int usb_dwc2_reset(void)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint32_t cnt = 0U;

	/* Wait for AHB master idle susb_dwc2_resettate. */
	while (!(base->grstctl & USB_DWC2_GRSTCTL_AHBIDLE)) {
		usb_dwc2_udelay(1);

		if (++cnt > USB_DWC2_CORE_RST_TIMEOUT_US) {
			LOG_ERR("USB reset HANG! AHB Idle GRSTCTL=0x%08x", base->grstctl);
			return -EIO;
		}
	}

	/* Core Soft Reset */
	cnt = 0U;
	base->grstctl |= USB_DWC2_GRSTCTL_CSFTRST;

	do {
		if (++cnt > USB_DWC2_CORE_RST_TIMEOUT_US) {
			LOG_DBG("USB reset HANG! Soft Reset GRSTCTL=0x%08x", base->grstctl);
			return -EIO;
		}
		usb_dwc2_udelay(1);
	} while (!(base->grstctl & (1 << 29)));
	base->grstctl |= 1 << 29;
	base->grstctl &= ~(1 << 0);
	/* Wait for 3 PHY Clocks */
	usb_dwc2_udelay(3000);

	return 0;
}

static int usb_dwc2_num_dev_eps(void)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;

	return (base->ghwcfg2 >> 10) & 0xf;
}

static void usb_dwc2_flush_tx_fifo(int ep)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	int fnum = usb_dwc2_ctrl.in_ep_ctrl[ep].fifo_num;

	base->grstctl = (fnum << 6) | (1 << 5);
	while (base->grstctl & (1 << 5)) {
	}
}

int usb_dwc2_tx_fifo_avail(int ep)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;

	return base->in_ep[ep].dtxfsts & USB_DWC2_DTXFSTS_INEPTXFSPCAVAIL_MASK;
}

/* Choose a FIFO number for an IN endpoint */
static int usb_dwc2_set_fifo(uint8_t ep)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	int ep_idx = USB_EP_GET_IDX(ep);
	volatile uint32_t *reg = &base->in_ep[ep_idx].diepctl;
	uint32_t val;
	int fifo = 0;
	int ded_fifo = !!(base->ghwcfg4 & USB_DWC2_GHWCFG4_DEDFIFOMODE);

	if (!ded_fifo) {
		/* No support for shared-FIFO mode yet, existing
		 * Zephyr hardware doesn't use it
		 */
		return -ENOTSUP;
	}

	/* In dedicated-FIFO mode, all IN endpoints must have a unique
	 * FIFO number associated with them in the TXFNUM field of
	 * DIEPCTLx, with EP0 always being assigned to FIFO zero (the
	 * reset default, so we don't touch it).
	 *
	 * FIXME: would be better (c.f. the dwc2 driver in Linux) to
	 * choose a FIFO based on the hardware depth: we want the
	 * smallest one that fits our configured maximum packet size
	 * for the endpoint.  This just picks the next available one.
	 */
	if (ep_idx != 0) {
		fifo = ep_idx;
		if (fifo >= usb_dwc2_num_dev_eps()) {
			return -EINVAL;
		}

		reg = &base->in_ep[ep_idx].diepctl;
		val = *reg & ~USB_DWC2_DEPCTL_TXFNUM_MASK;
		val |= fifo << USB_DWC2_DEPCTL_TXFNUM_POS;
		*reg = val;
	}

	usb_dwc2_ctrl.in_ep_ctrl[ep_idx].fifo_num = fifo;

	usb_dwc2_flush_tx_fifo(ep_idx);

	val = usb_dwc2_tx_fifo_avail(ep_idx);
	usb_dwc2_ctrl.in_ep_ctrl[ep_idx].fifo_size = val;

	return 0;
}

static int usb_dwc2_ep_set(uint8_t ep, uint32_t ep_mps, enum usb_dc_ep_transfer_type ep_type)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	volatile uint32_t *p_depctl;
	uint8_t ep_idx = USB_EP_GET_IDX(ep);

	LOG_DBG("%s ep %x, mps %d, type %d", __func__, ep, ep_mps, ep_type);

	if (USB_EP_DIR_IS_OUT(ep)) {
		p_depctl = &base->out_ep[ep_idx].doepctl;
		usb_dwc2_ctrl.out_ep_ctrl[ep_idx].mps = ep_mps;
	} else {
		p_depctl = &base->in_ep[ep_idx].diepctl;
		usb_dwc2_ctrl.in_ep_ctrl[ep_idx].mps = ep_mps;
	}

	if (!ep_idx) {
		/* Set max packet size for EP0 */
		*p_depctl &= ~USB_DWC2_DEPCTL0_MPS_MASK;

		switch (ep_mps) {
		case 8:
			*p_depctl |= USB_DWC2_DEPCTL0_MPS_8 << USB_DWC2_DEPCTL_MPS_POS;
			break;
		case 16:
			*p_depctl |= USB_DWC2_DEPCTL0_MPS_16 << USB_DWC2_DEPCTL_MPS_POS;
			break;
		case 32:
			*p_depctl |= USB_DWC2_DEPCTL0_MPS_32 << USB_DWC2_DEPCTL_MPS_POS;
			break;
		case 64:
			*p_depctl |= USB_DWC2_DEPCTL0_MPS_64 << USB_DWC2_DEPCTL_MPS_POS;
			break;
		default:
			return -EINVAL;
		}
		/* No need to set EP0 type */
	} else {
		/* Set max packet size for EP */
		if (ep_mps > (0x3ff >> USB_DWC2_DEPCTL_MPS_POS)) {
			return -EINVAL;
		}

		*p_depctl &= ~0x3ff;
		*p_depctl |= ep_mps << USB_DWC2_DEPCTL_MPS_POS;

		/* Set endpoint type */
		*p_depctl &= ~USB_DWC2_DEPCTL_EPTYPE_MASK;

		switch (ep_type) {
		case USB_DC_EP_CONTROL:
			*p_depctl |= USB_DWC2_DEPCTL_EPTYPE_CONTROL << USB_DWC2_DEPCTL_EPTYPE_POS;
			break;
		case USB_DC_EP_BULK:
			*p_depctl |= USB_DWC2_DEPCTL_EPTYPE_BULK << USB_DWC2_DEPCTL_EPTYPE_POS;
			break;
		case USB_DC_EP_INTERRUPT:
			*p_depctl |= USB_DWC2_DEPCTL_EPTYPE_INTERRUPT << USB_DWC2_DEPCTL_EPTYPE_POS;
			break;
		default:
			return -EINVAL;
		}

		/* sets the Endpoint Data PID to DATA0 */
		*p_depctl |= USB_DWC2_DEPCTL_SETD0PID;
	}

	if (USB_EP_DIR_IS_IN(ep)) {
		int ret = usb_dwc2_set_fifo(ep);

		if (ret) {
			return ret;
		}
	}

	return 0;
}

static void usb_dwc2_flush_all_fifo(void)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	grstctl_t grstctl = {.b = {.txfnum = 0x10, .txfflsh = 1, .rxfflsh = 1}};

	base->grstctl = grstctl.d32;
	do {
		grstctl.d32 = base->grstctl;
	} while (grstctl.b.txfflsh || grstctl.b.rxfflsh);
}

static void usb_dwc2_resize_fifo(void)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;

	/* 1. Get Tx FIFO size, and caculate Rx FIFO size. */
	uint32_t total_fifo_size = base->ghwcfg3 >> 16;
	uint32_t total_tx_fifo_size = 0;

	for (uint8_t epidx = 0; epidx < 6; ++epidx) {
		total_tx_fifo_size += TX_FIFO_SIZE(epidx);
	}

	uint32_t rx_fifo_size = total_fifo_size - total_tx_fifo_size;

	/* 2. Write back. */
	base->grxfsiz = rx_fifo_size;

	typedef union fifosize_data {
		/* raw register data */
		uint32_t d32;
		/* register bits */
		struct {
			unsigned startaddr: 16;
			unsigned depth: 16;
		} b;
	} fifosize_data_t;
	fifosize_data_t curr_fifo, last_fifo;

