zophai-liu/rtk-zephyr/drivers/usb/device/usb_dc_rtl87x2g.c
	curr_fifo.d32 = base->gnptxfsiz;
	curr_fifo.b.startaddr = rx_fifo_size;
	curr_fifo.b.depth = TX_FIFO_SIZE(0);
	base->gnptxfsiz = curr_fifo.d32;

	last_fifo = curr_fifo;

	for (uint8_t epidx = 1; epidx < 6; ++epidx) {
		kaTxFifoAddrTable[epidx] = curr_fifo.b.depth + kaTxFifoAddrTable[epidx - 1];
		curr_fifo.d32 = (base->dieptxf)[epidx - 1];
		curr_fifo.b.startaddr = last_fifo.b.startaddr + last_fifo.b.depth;
		curr_fifo.b.depth = TX_FIFO_SIZE(epidx);
		(base->dieptxf)[epidx - 1] = curr_fifo.d32;
		last_fifo = curr_fifo;
	}

	usb_dwc2_flush_all_fifo();

	/* 4. Link FIFO to IN ep. */
	for (uint8_t epidx = 0; epidx < 6; ++epidx) {
		uint32_t diepctl = base->in_ep[epidx].diepctl;

		diepctl &= (~((BIT4 - 1) << 22));
		diepctl |= (epidx << 22);
		base->in_ep[epidx].diepctl = diepctl;
	}
}

static int usb_rtk_init(void)
{
#if CONFIG_USB_DC_RTL87X2G_DMA
	extern void hal_rtk_usb_init_dma(void);
	hal_rtk_usb_init_dma();
#else
	extern void hal_rtk_usb_init(void);
	hal_rtk_usb_init();
#endif
	return 0;
}

static void usb_dwc2_handle_reset(void)
{
#if CONFIG_USB_DC_RTL87X2G_DMA
	usb_dwc2_ctrl.current_status = USB_DC_RESET;
	/* Inform upper layers */
	if (usb_dwc2_ctrl.status_cb) {
		usb_dwc2_ctrl.status_cb(USB_DC_RESET, NULL);
	}

	usb_dwc2_reset();
	usb_rtk_init();
	usb_dwc2_resize_fifo();

#else
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;

	usb_dwc2_ctrl.current_status = USB_DC_RESET;
	/* Inform upper layers */
	if (usb_dwc2_ctrl.status_cb) {
		usb_dwc2_ctrl.status_cb(USB_DC_RESET, NULL);
	}

	usb_dwc2_resize_fifo();

	/* Clear device address during reset. */
	base->dcfg &= ~USB_DWC2_DCFG_DEVADDR_MASK;

	/* enable global EP interrupts */
	base->doepmsk = 0U;
	base->gintmsk |= USB_DWC2_GINTSTS_RXFLVL;
	base->diepmsk |= USB_DWC2_DIEPINT_XFERCOMPL;
#endif
}

#if CONFIG_USB_DC_RTL87X2G_DMA
static uint32_t usb_get_in_xfer_max_bytes(uint8_t ep_idx)
{
	uint16_t ep_mps = usb_dwc2_ctrl.in_ep_ctrl[ep_idx].mps;

	return 0xffff / ep_mps * ep_mps;
}

static int usb_ep_dma_send(uint8_t ep_idx)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;

	usb_dwc2_ctrl.aInXfer[ep_idx]->BytesSent += usb_dwc2_ctrl.aInXfer[ep_idx]->BytesSending;
	usb_dwc2_ctrl.aInXfer[ep_idx]->BytesSending = 0;
	if (usb_dwc2_ctrl.aInXfer[ep_idx]->BytesSent < usb_dwc2_ctrl.aInXfer[ep_idx]->BytesTotal) {
		const uint16_t ep_mps = usb_dwc2_ctrl.in_ep_ctrl[ep_idx].mps;
		uint32_t bytes_residual = usb_dwc2_ctrl.aInXfer[ep_idx]->BytesTotal -
					  usb_dwc2_ctrl.aInXfer[ep_idx]->BytesSent;
		uint32_t xfer_bytes = usb_get_in_xfer_max_bytes(ep_idx) < bytes_residual
					      ? usb_get_in_xfer_max_bytes(ep_idx)
					      : bytes_residual;
		volatile InDmaDesc_t *pDmaDesc = usb_dwc2_ctrl.aInDmaDesc[ep_idx];

		pDmaDesc->Quad.NonIso.TxBytes = xfer_bytes;
		pDmaDesc->Quad.NonIso.Reserved0 = 0;
		pDmaDesc->Quad.NonIso.InterruptOnComplete = 1;
		pDmaDesc->Quad.NonIso.ShortPacket = (xfer_bytes % ep_mps != 0);
		pDmaDesc->Quad.NonIso.Last = 1;
		pDmaDesc->Quad.NonIso.TransmitState = QUAD_TXSTS_SUCCESS;
		pDmaDesc->Quad.NonIso.BufferState = QUAD_BS_HOST_READY;

		pDmaDesc->BufAddr = (uint32_t)usb_dwc2_ctrl.aInXfer[ep_idx]->pBuf +
				    usb_dwc2_ctrl.aInXfer[ep_idx]->BytesSent;

		base->in_ep[ep_idx].diepdma = (uint32_t)pDmaDesc;
		base->in_ep[ep_idx].diepctl |= USB_DWC2_DEPCTL_EPENA | BIT26;

		usb_dwc2_ctrl.aInXfer[ep_idx]->BytesSending = xfer_bytes;
		return xfer_bytes;
	} else if (usb_dwc2_ctrl.aInXfer[ep_idx]->ToSendZlp) {
		/* All data has been sent, and only zlp is waiting to send. Send zlp. */
		volatile InDmaDesc_t *pDmaDesc = usb_dwc2_ctrl.aInDmaDesc[ep_idx];

		pDmaDesc->Quad.NonIso.TxBytes = 0;
		pDmaDesc->Quad.NonIso.Reserved0 = 0;
		pDmaDesc->Quad.NonIso.InterruptOnComplete = 1;
		pDmaDesc->Quad.NonIso.ShortPacket = 1;
		pDmaDesc->Quad.NonIso.Last = 1;
		pDmaDesc->Quad.NonIso.TransmitState = QUAD_TXSTS_SUCCESS;
		pDmaDesc->Quad.NonIso.BufferState = QUAD_BS_HOST_READY;

		pDmaDesc->BufAddr = (uint32_t)usb_dwc2_ctrl.aInXfer[ep_idx]->pBuf +
				    usb_dwc2_ctrl.aInXfer[ep_idx]->BytesSent;

		base->in_ep[ep_idx].diepdma = (uint32_t)pDmaDesc;
		base->in_ep[ep_idx].diepctl |= USB_DWC2_DEPCTL_EPENA | BIT26;

		usb_dwc2_ctrl.aInXfer[ep_idx]->ToSendZlp = false;
	}

	return 0;
}

static int usb_dwc2_tx_dma(uint8_t ep, const uint8_t *const data, uint32_t data_len)
{
	enum usb_dwc2_in_ep_idx ep_idx = USB_EP_GET_IDX(ep);

	usb_dwc2_ctrl.aInXfer[ep_idx]->pBuf = data;
	usb_dwc2_ctrl.aInXfer[ep_idx]->BytesTotal = data_len;
	usb_dwc2_ctrl.aInXfer[ep_idx]->BytesSent = 0;
	usb_dwc2_ctrl.aInXfer[ep_idx]->BytesSending = 0;
	usb_dwc2_ctrl.aInXfer[ep_idx]->ToSendZlp = data_len == 0;

	return usb_ep_dma_send(ep_idx);
}

static uint32_t usb_get_out_xfer_max_bytes(uint8_t ep_idx)
{
	uint16_t ep_mps = usb_dwc2_ctrl.out_ep_ctrl[ep_idx].mps;

	return (ep_idx == 0) ? ep_mps : (0xffff / ep_mps * ep_mps);
}

static int usb_ep_dma_receive(uint8_t ep_idx)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	const uint16_t ep_mps = usb_dwc2_ctrl.out_ep_ctrl[ep_idx].mps;
	volatile OutDmaDesc_t *pDmaDesc = usb_dwc2_ctrl.aOutDmaDesc[ep_idx];
	bool MoreDataToRcv;

	if (usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesRcving == 0) {
		MoreDataToRcv = true;
	} else {
		uint32_t BytesRcvedThisCycle =
			usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesRcving - pDmaDesc->Quad.NonIso.RxBytes;

		usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesRcved += BytesRcvedThisCycle;
		usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesRcving = 0;
		if (usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesRcved ==
			    usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesTotal ||
		    pDmaDesc->Quad.NonIso.ShortPacket) {
			/* All bytes were received, or short packet was received. Out xfer complete.
			 */
			MoreDataToRcv = false;
		} else {
			MoreDataToRcv = true;
		}
	}

	if (MoreDataToRcv) {
		uint32_t bytes_residual = usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesTotal -
					  usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesRcved;
		uint32_t xfer_bytes = usb_get_out_xfer_max_bytes(ep_idx) < bytes_residual
					      ? usb_get_out_xfer_max_bytes(ep_idx)
					      : bytes_residual;

		usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesRcving =
			(xfer_bytes + ep_mps - 1) / ep_mps * ep_mps;

		pDmaDesc->Quad.NonIso.RxBytes = usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesRcving;
		pDmaDesc->Quad.NonIso.Reserved0 = 0;
		pDmaDesc->Quad.NonIso.MTRF = 0;
		pDmaDesc->Quad.NonIso.SR = 0;
		pDmaDesc->Quad.NonIso.InterruptOnComplete = 1;
		pDmaDesc->Quad.NonIso.ShortPacket = 0;
		pDmaDesc->Quad.NonIso.Last = 1;
		pDmaDesc->Quad.NonIso.ReceiveState = QUAD_RXSTS_SUCCESS;
		pDmaDesc->Quad.NonIso.BufferState = QUAD_BS_HOST_READY;

		pDmaDesc->BufAddr = (uint32_t)usb_dwc2_ctrl.aOutXfer[ep_idx]->pBuf +
				    usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesRcved;

		base->out_ep[ep_idx].doepdma = (uint32_t)pDmaDesc;

