zophai-liu/rtk-zephyr/drivers/usb/device/usb_dc_rtl87x2g.c
		base->out_ep[ep_idx].doepctl |= USB_DWC2_DEPCTL_EPENA | BIT26;
	}

	return 0;
}

static int usb_dwc2_rx_dma(const uint8_t ep, uint8_t *data, const uint32_t read_bytes)
{
	enum usb_dwc2_in_ep_idx ep_idx = USB_EP_GET_IDX(ep);

	usb_dwc2_ctrl.aOutXfer[ep_idx]->pBuf = data;
	usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesTotal = read_bytes;
	usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesRcving = 0;
	usb_dwc2_ctrl.aOutXfer[ep_idx]->BytesRcved = 0;

	return usb_ep_dma_receive(ep_idx);
}

#else
static int usb_dwc2_tx(uint8_t ep, const uint8_t *const data, uint32_t data_len)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	enum usb_dwc2_in_ep_idx ep_idx = USB_EP_GET_IDX(ep);
	uint32_t max_xfer_size, max_pkt_cnt, pkt_cnt, avail_space;
	uint32_t ep_mps = usb_dwc2_ctrl.in_ep_ctrl[ep_idx].mps;
	unsigned int key;
	uint32_t i;
	uint32_t tx_data_len = data_len;

#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] base->in_ep[%d].diepctl=0x%x", __func__, ep_idx,
		   base->in_ep[ep_idx].diepctl);
#endif

	/* Wait for FIFO space available */
	do {
		avail_space = usb_dwc2_tx_fifo_avail(ep_idx);
		if (avail_space == usb_dwc2_ctrl.in_ep_ctrl[ep_idx].fifo_size) {
			break;
		}
		/* Make sure we don't hog the CPU */
		k_yield();
	} while (1);
	key = irq_lock();

	avail_space *= 4U;
	if (!avail_space) {
		LOG_ERR("USB IN EP%d no space available, DTXFSTS %x", ep_idx,
			base->in_ep[ep_idx].dtxfsts);
		irq_unlock(key);
		return -EAGAIN;
	}

	/* For now tx-fifo sizes are not configured (cf usb_dwc2_set_fifo). Here
	 * we force available fifo size to be a multiple of ep mps in order to
	 * prevent splitting data incorrectly.
	 */
	avail_space -= avail_space % ep_mps;
	if (data_len > avail_space) {
		data_len = avail_space;
	}

	if (data_len != 0U) {
		/* Get max packet size and packet count for ep */
		if (ep_idx == USB_DWC2_IN_EP_0) {
			max_pkt_cnt = 1;
			max_xfer_size = ep_mps;
		} else {
			max_pkt_cnt =
				USB_DWC2_DIEPTSIZn_PKT_CNT_MASK >> USB_DWC2_DEPTSIZ_PKT_CNT_POS;
			max_xfer_size =
				USB_DWC2_DEPTSIZn_XFER_SIZE_MASK >> USB_DWC2_DEPTSIZ_XFER_SIZE_POS;
		}

		/* Check if transfer len is too big */
		if (data_len > max_xfer_size) {
			LOG_WRN("USB IN EP%d len too big (%d->%d)", ep_idx, data_len,
				max_xfer_size);
			data_len = max_xfer_size;
		}

		/*
		 * Program the transfer size and packet count as follows:
		 *
		 * transfer size = N * ep_maxpacket + short_packet
		 * pktcnt = N + (short_packet exist ? 1 : 0)
		 */

		pkt_cnt = DIV_ROUND_UP(data_len, ep_mps);
		if (pkt_cnt > max_pkt_cnt) {
			LOG_WRN("USB IN EP%d pkt count too big (%d->%d)", ep_idx, pkt_cnt, pkt_cnt);
			pkt_cnt = max_pkt_cnt;
			data_len = pkt_cnt * ep_mps;
		}
	} else {
		/* Zero length packet */
		pkt_cnt = 1U;
	}

	if (tx_data_len > data_len) {
		usb_dwc2_ctrl.in_ep_ctrl[ep_idx].rsvd_tx_len = tx_data_len - data_len;
		usb_dwc2_ctrl.in_ep_ctrl[ep_idx].rsvd_tx_buf = data + data_len;
	} else {
		usb_dwc2_ctrl.in_ep_ctrl[ep_idx].rsvd_tx_len = 0;
		usb_dwc2_ctrl.in_ep_ctrl[ep_idx].rsvd_tx_buf = NULL;
	}

	/* Set number of packets and transfer size */
	base->in_ep[ep_idx].dieptsiz = (pkt_cnt << USB_DWC2_DEPTSIZ_PKT_CNT_POS) | data_len;

	/* Clear NAK and enable ep */
	base->in_ep[ep_idx].diepctl |= (USB_DWC2_DEPCTL_EPENA | USB_DWC2_DEPCTL_CNAK);

	/*
	 * Write data to FIFO, make sure that we are protected against
	 * other USB register accesses.  According to "DesignWare Cores
	 * USB 1.1/2.0 Device Subsystem-AHB/VCI Databook": "During FIFO
	 * access, the application must not access the UDC/Subsystem
	 * registers or vendor registers (for ULPI mode). After starting
	 * to access a FIFO, the application must complete the transaction
	 * before accessing the register."
	 */
	for (i = 0U; i < data_len; i += 4U) {
		uint32_t val = data[i];

		if (i + 1 < data_len) {
			val |= ((uint32_t)data[i + 1]) << 8;
		}
		if (i + 2 < data_len) {
			val |= ((uint32_t)data[i + 2]) << 16;
		}
		if (i + 3 < data_len) {
			val |= ((uint32_t)data[i + 3]) << 24;
		}
#if DBG_DIRECT_SHOW
		DBG_DIRECT("val=%x", val);
#endif
		USB_DWC2_EP_TX_FIFO(base, ep_idx) = val;
	}

	irq_unlock(key);

#if DBG_DIRECT_SHOW
	DBG_DIRECT("USB IN EP%d write %d bytes", ep_idx, data_len);
#endif

	return data_len;
}

#endif /* CONFIG_USB_DC_RTL87X2G_DMA */

static void usb_dwc2_prep_rx(const uint8_t ep, uint8_t setup)
{
#if CONFIG_USB_DC_RTL87X2G_DMA
	enum usb_dwc2_out_ep_idx ep_idx = USB_EP_GET_IDX(ep);
	uint32_t ep_mps = usb_dwc2_ctrl.out_ep_ctrl[ep_idx].mps;

	usb_dwc2_rx_dma(ep, usb_dwc2_ctrl.ep_rx_buf[ep_idx], ep_mps);

	LOG_DBG("USB OUT EP%d armed", ep_idx);

#else
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	enum usb_dwc2_out_ep_idx ep_idx = USB_EP_GET_IDX(ep);
	uint32_t ep_mps = usb_dwc2_ctrl.out_ep_ctrl[ep_idx].mps;

	/* Set max RX size to EP mps so we get an interrupt
	 * each time a packet is received
	 */

	base->out_ep[ep_idx].doeptsiz = (USB_DWC2_SUP_CNT << USB_DWC2_DOEPTSIZ_SUP_CNT_POS) |
					(1 << USB_DWC2_DEPTSIZ_PKT_CNT_POS) | ep_mps;

	/* Clear NAK and enable ep */
	if (!setup) {
		base->out_ep[ep_idx].doepctl |= USB_DWC2_DEPCTL_CNAK;
	}

	base->out_ep[ep_idx].doepctl |= USB_DWC2_DEPCTL_EPENA;

	LOG_DBG("USB OUT EP%d armed", ep_idx);
#endif
}

void usb_dwc2_handle_enum_done(void)
{
#if CONFIG_USB_DC_RTL87X2G_DMA
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint8_t speed;
	uint32_t ep_mps;

	speed = (base->dsts & ~USB_DWC2_DSTS_ENUMSPD_MASK) >> USB_DWC2_DSTS_ENUMSPD_POS;

	usb_dwc2_ctrl.current_status = USB_DC_CONNECTED;
	/* Inform upper layers */
	if (usb_dwc2_ctrl.status_cb) {
		usb_dwc2_ctrl.status_cb(USB_DC_CONNECTED, &speed);
	}

	base->in_ep[0].diepctl = (base->in_ep[0].diepctl & ~USB_DWC2_DIEPCTL_MPS_MSAK) |
				 USB_DWC2_DIEPCTL_MPS_64BYTES;
	base->out_ep[0].doepctl = (base->out_ep[0].doepctl & ~USB_DWC2_DOEPCTL_MPS_MSAK) |
				  USB_DWC2_DOEPCTL_MPS_64BYTES;
	ep_mps = usb_dwc2_ctrl.out_ep_ctrl[0].mps;
	usb_dwc2_rx_dma(0, usb_dwc2_ctrl.ep_rx_buf[0], ep_mps);

#else
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint8_t speed;

	speed = (base->dsts & USB_DWC2_DSTS_ENUMSPD_MASK) >> USB_DWC2_DSTS_ENUMSPD_POS;

	LOG_DBG("USB ENUM DONE event, %s speed detected", speed == 0 ? "High" : "Full");
#if DBG_DIRECT_SHOW
	DBG_DIRECT("USB ENUM DONE event, %s speed detected", speed == 0 ? "High" : "Full");
#endif

	usb_dwc2_ctrl.current_status = USB_DC_CONNECTED;
	/* Inform upper layers */
	if (usb_dwc2_ctrl.status_cb) {
		usb_dwc2_ctrl.status_cb(USB_DC_CONNECTED, &speed);
	}
#endif
}

/* USB ISR handler */
static inline void usb_dwc2_int_rx_flvl_handler(void)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint32_t grxstsp = base->grxstsp;
	uint32_t status, xfer_size;
	uint8_t ep_idx;
	usb_dc_ep_callback ep_cb;

	/* Packet in RX FIFO */

	ep_idx = grxstsp & USB_DWC2_GRXSTSR_EPNUM_MASK;
	status = (grxstsp & USB_DWC2_GRXSTSR_PKTSTS_MASK) >> USB_DWC2_GRXSTSR_PKTSTS_POS;
	xfer_size = (grxstsp & USB_DWC2_GRXSTSR_BCNT_MASK) >> USB_DWC2_GRXSTSR_BCNT_POS;

	LOG_DBG("USB OUT EP%u: RX_FLVL status %u, size %u", ep_idx, status, xfer_size);
#if DBG_DIRECT_SHOW
	DBG_DIRECT("USB OUT EP%d: grxstsp status %d, size %d", ep_idx, status, xfer_size);
#endif

	usb_dwc2_ctrl.out_ep_ctrl[ep_idx].data_len = xfer_size;
	ep_cb = usb_dwc2_ctrl.out_ep_ctrl[ep_idx].cb;

	switch (status) {
#if CONFIG_USB_DC_RTL87X2G_DMA
	case 12:
#endif
	case USB_DWC2_GRXSTSR_PKTSTS_SETUP:
		LOG_DBG("USB_DWC2_GRXSTSR_PKTSTS_SETUP");
#if DBG_DIRECT_SHOW
		DBG_DIRECT("USB_DWC2_GRXSTSR_PKTSTS_SETUP");
#endif
		/* Call the registered callback if any */
		if (ep_cb) {
			ep_cb(USB_EP_GET_ADDR(ep_idx, USB_EP_DIR_OUT), USB_DC_EP_SETUP);
		}

		break;
	case USB_DWC2_GRXSTSR_PKTSTS_OUT_DATA:
		LOG_DBG("USB_DWC2_GRXSTSR_PKTSTS_OUT_DATA");
#if DBG_DIRECT_SHOW
		DBG_DIRECT("USB_DWC2_GRXSTSR_PKTSTS_OUT_DATA");
#endif
		if (ep_cb) {
			ep_cb(USB_EP_GET_ADDR(ep_idx, USB_EP_DIR_OUT), USB_DC_EP_DATA_OUT);
		}

		break;
	case USB_DWC2_GRXSTSR_PKTSTS_OUT_DATA_DONE:
		LOG_DBG("USB_DWC2_GRXSTSR_PKTSTS_OUT_DATA_DONE");
#if DBG_DIRECT_SHOW
		DBG_DIRECT("USB_DWC2_GRXSTSR_PKTSTS_OUT_DATA_DONE");
#endif
		break;
	case USB_DWC2_GRXSTSR_PKTSTS_SETUP_DONE:
		LOG_DBG("USB_DWC2_GRXSTSR_PKTSTS_SETUP_DONE");
#if DBG_DIRECT_SHOW
		DBG_DIRECT("USB_DWC2_GRXSTSR_PKTSTS_SETUP_DONE");
#endif
		break;
	default:
		break;
	}
}

static inline void usb_dwc2_int_iep_handler(void)
{
#if CONFIG_USB_DC_RTL87X2G_DMA
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint32_t ep_int_status;
	uint32_t ActDaint = base->daint & base->daintmsk;
	uint8_t ep_idx = 0;
	usb_dc_ep_callback ep_cb;
	uint32_t ep_mps;

	if (ActDaint & USB_DWC2_DAINT_INEPINT(ep_idx)) {
		ep_int_status = base->in_ep[ep_idx].diepint & base->diepmsk;
#if DBG_DIRECT_SHOW
		DBG_DIRECT("[%s] Ep0 diepint: 0x%x", __func__, ep_int_status);
#endif
		base->in_ep[ep_idx].diepint = ep_int_status;
		ep_mps = usb_dwc2_ctrl.out_ep_ctrl[ep_idx].mps;
		usb_dwc2_rx_dma(ep_idx, usb_dwc2_ctrl.ep_rx_buf[ep_idx], ep_mps);

