zophai-liu/rtk-zephyr/drivers/usb/device/usb_dc_rtl87x2g.c
		ep_cb = usb_dwc2_ctrl.in_ep_ctrl[ep_idx].cb;
		if (ep_cb && (ep_int_status & USB_DWC2_DIEPINT_XFERCOMPL)) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT("[%s] USB_DWC2_DIEPINT_XFERCOMPL", __func__);
#endif
			ep_cb(USB_EP_GET_ADDR(ep_idx, USB_EP_DIR_IN), USB_DC_EP_DATA_IN);
		}
	}
	for (ep_idx = 1U; ep_idx < USB_DWC2_IN_EP_NUM; ep_idx++) {
		if (base->daint & USB_DWC2_DAINT_INEPINT(ep_idx)) {
			/* Read IN EP interrupt status */
			ep_int_status = base->in_ep[ep_idx].diepint & base->diepmsk;
#if DBG_DIRECT_SHOW
			DBG_DIRECT("[%s] Ep%d diepint: 0x%x", __func__, ep_idx, ep_int_status);
#endif
			base->in_ep[ep_idx].diepint = ep_int_status;
			ep_cb = usb_dwc2_ctrl.in_ep_ctrl[ep_idx].cb;
			if (ep_cb && (ep_int_status & USB_DWC2_DIEPINT_XFERCOMPL)) {

				/* Call the registered callback */
				ep_cb(USB_EP_GET_ADDR(ep_idx, USB_EP_DIR_IN), USB_DC_EP_DATA_IN);
			}
		}
	}
#else
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint32_t ep_int_status;
	uint8_t ep_idx;
	usb_dc_ep_callback ep_cb;

	for (ep_idx = 0U; ep_idx < USB_DWC2_IN_EP_NUM; ep_idx++) {
		if (base->daint & USB_DWC2_DAINT_INEPINT(ep_idx)) {
			/* Read IN EP interrupt status */
			ep_int_status = base->in_ep[ep_idx].diepint & base->diepmsk;

			/* Clear IN EP interrupts */
			base->in_ep[ep_idx].diepint = ep_int_status;

			LOG_DBG("USB IN EP%u interrupt status: 0x%x", ep_idx, ep_int_status);

			ep_cb = usb_dwc2_ctrl.in_ep_ctrl[ep_idx].cb;
			if (ep_cb && (ep_int_status & USB_DWC2_DIEPINT_XFERCOMPL)) {
				/* Call the registered callback */
				ep_cb(USB_EP_GET_ADDR(ep_idx, USB_EP_DIR_IN), USB_DC_EP_DATA_IN);
			}
		}
	}

	/* Clear interrupt. */
	base->gintsts = USB_DWC2_GINTSTS_IEPINT;
#endif
}

#if CONFIG_USB_DC_RTL87X2G_DMA
static void Ep0ParseSetupPkt(void)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint8_t ep_idx;
	usb_dc_ep_callback ep_cb;
	uint32_t grxstsp = base->grxstsp;

	ep_idx = grxstsp & USB_DWC2_GRXSTSR_EPNUM_MASK;
	ep_cb = usb_dwc2_ctrl.out_ep_ctrl[ep_idx].cb;
	ep_cb(USB_EP_GET_ADDR(ep_idx, USB_EP_DIR_OUT), USB_DC_EP_SETUP);
}
#endif

static inline void usb_dwc2_int_oep_handler(void)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint32_t ep_int_status;
	uint8_t ep_idx = 0;

#if CONFIG_USB_DC_RTL87X2G_DMA
	if (base->daint & USB_DWC2_DAINT_OUTEPINT(ep_idx)) {
		ep_int_status = base->out_ep[ep_idx].doepint & base->doepmsk;
		base->out_ep[ep_idx].doepint = ep_int_status;
#if DBG_DIRECT_SHOW
		DBG_DIRECT("[%s] Ep0 doepint: 0x%x", __func__, ep_int_status);
#endif

		if (!(ep_int_status & USB_DWC2_DOEPINT_SETUP) &&
		    (ep_int_status & USB_DWC2_DOEPINT_XFERCOMPL)) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT("[%s] EP0EVENT_OEPINT_XFERCMPL", __func__);
#endif
		} else if ((ep_int_status & USB_DWC2_DOEPINT_SETUP) &&
			   !(ep_int_status & USB_DWC2_DOEPINT_XFERCOMPL)) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT("[%s] EP0EVENT_OEPINT_SETUPDONE", __func__);
#endif
		} else if ((ep_int_status & USB_DWC2_DOEPINT_SETUP) &&
			   (ep_int_status & USB_DWC2_DOEPINT_XFERCOMPL)) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT("[%s] EP0EVENT_OEPINT_XFERCMPL_AND_SETUPDONE", __func__);
#endif
			Ep0ParseSetupPkt();

		} else if ((ep_int_status & USB_DWC2_DOEPINT_STSPHSERCVD) &&
			   !(ep_int_status & USB_DWC2_DOEPINT_XFERCOMPL)) {
			base->out_ep[ep_idx].doepctl |= USB_DWC2_DEPCTL_CNAK;
		}

		if (ep_int_status & USB_DWC2_DOEPINT_AHBERR ||
		    ep_int_status & USB_DWC2_DOEPINT_BNAINTR) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT("[%s] USB_DWC2_DOEPINT_BNAINTR", __func__);
#endif
		}
	}
#endif
#if CONFIG_USB_DC_RTL87X2G_DMA
	for (ep_idx = 1U; ep_idx < USB_DWC2_OUT_EP_NUM; ep_idx++)
#else
	for (ep_idx = 0U; ep_idx < USB_DWC2_OUT_EP_NUM; ep_idx++)
#endif
	{
		if (base->daint & USB_DWC2_DAINT_OUTEPINT(ep_idx)) {
			/* Read OUT EP interrupt status */
			ep_int_status = base->out_ep[ep_idx].doepint & base->doepmsk;

			/* Clear OUT EP interrupts */
			base->out_ep[ep_idx].doepint = ep_int_status;

			LOG_DBG("USB OUT EP%u interrupt status: 0x%x\n", ep_idx, ep_int_status);
		}
	}

	/* Clear interrupt. */
	base->gintsts = USB_DWC2_GINTSTS_OEPINT;
}

static void usb_dwc2_isr_handler(const void *unused)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint32_t int_status;

#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	ARG_UNUSED(unused);
	/*  Read interrupt status */
	while ((int_status = (base->gintsts & base->gintmsk))) {
		LOG_WRN("current addr:%d",
			(base->dcfg & USB_DWC2_DCFG_DEVADDR_MASK) >> USB_DWC2_DCFG_DEVADDR_POS);

		if (int_status & USB_DWC2_GINTSTS_USBRST) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT("-------------------USB_DWC2_GINTSTS_USBRST-------------------");
#endif
			LOG_WRN("USB_DWC2_GINTSTS_USBRST");
			/* Clear interrupt. */
			base->gintsts = USB_DWC2_GINTSTS_USBRST;

			/* Reset detected */
			usb_dwc2_handle_reset();
		}

		if (int_status & USB_DWC2_GINTSTS_ENUMDONE) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT(
				"-------------------USB_DWC2_GINTSTS_ENUMDONE-------------------");
#endif
			LOG_WRN("USB_DWC2_GINTSTS_ENUMDONE");
			/* Clear interrupt. */
			base->gintsts = USB_DWC2_GINTSTS_ENUMDONE;

			/* Enumeration done detected */
			usb_dwc2_handle_enum_done();
		}

		if (int_status & USB_DWC2_GINTSTS_USBSUSP) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT(
				"-------------------USB_DWC2_GINTSTS_USBSUSP-------------------");
#endif
			LOG_WRN("USB_DWC2_GINTSTS_USBSUSP");
			/* Clear interrupt. */
			base->gintsts = USB_DWC2_GINTSTS_USBSUSP;
			extern int hal_usb_suspend_enter(void);

			hal_usb_suspend_enter();

			usb_power_is_on = false;

			usb_dwc2_ctrl.current_status = USB_DC_SUSPEND;
			if (usb_dwc2_ctrl.status_cb) {
				usb_dwc2_ctrl.status_cb(USB_DC_SUSPEND, NULL);
			}
			return;
		}

		if (int_status & USB_DWC2_GINTSTS_WKUPINT) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT(
				"-------------------USB_DWC2_GINTSTS_WKUPINT-------------------");
#endif
			LOG_WRN("USB_DWC2_GINTSTS_WKUPINT");
			/* Clear interrupt. */
			base->gintsts = USB_DWC2_GINTSTS_WKUPINT;

			usb_dwc2_ctrl.current_status = USB_DC_RESUME;
			if (usb_dwc2_ctrl.status_cb) {
				usb_dwc2_ctrl.status_cb(USB_DC_RESUME, NULL);
			}
		}

		if (int_status & USB_DWC2_GINTSTS_RXFLVL) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT("-------------------USB_DWC2_GINTSTS_RXFLVL-------------------");
#endif
			LOG_WRN("USB_DWC2_GINTSTS_RXFLVL");
			/* Packet in RX FIFO */
			usb_dwc2_int_rx_flvl_handler();
		}

