zophai-liu/rtk-zephyr/drivers/usb/device/usb_dc_rtl87x2g.c
		if (int_status & USB_DWC2_GINTSTS_IEPINT) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT("-------------------USB_DWC2_GINTSTS_IEPINT-------------------");
#endif
			LOG_WRN("USB_DWC2_GINTSTS_IEPINT");
			/* IN EP interrupt */
			usb_dwc2_int_iep_handler();
		}

		if (int_status & USB_DWC2_GINTSTS_OEPINT) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT("-------------------USB_DWC2_GINTSTS_OEPINT-------------------");
#endif
			LOG_WRN("USB_DWC2_GINTSTS_OEPINT");
			/* No OUT interrupt expected in FIFO mode,
			 * just clear interrupt
			 */
			usb_dwc2_int_oep_handler();
		}
	}
}

static void usb_dwc2_resume_isr_handler(const void *unused)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("-------------------USB_DWC2_RESUME_INT-------------------");
#endif
	SoC_VENDOR->u_004.REG_LOW_PRI_INT_STATUS |= BIT31;
	/* prevent false alarm */
	usb_rtk_resume_sequence();

	usb_power_is_on = true;

	usb_dwc2_ctrl.current_status = USB_DC_RESUME;
	if (usb_dwc2_ctrl.status_cb) {
		usb_dwc2_ctrl.status_cb(USB_DC_RESUME, NULL);
	}
	return;
}

#if CONFIG_PM
static void usb_register_dlps_cb(void);
#endif

int usb_dc_attach(void)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	int ret;

	if (usb_dwc2_ctrl.attached) {
		return 0;
	}

	if (usb_dwc2_cfg.pwr_on_func != NULL) {
		ret = usb_dwc2_cfg.pwr_on_func(NULL);
		if (ret) {
			LOG_ERR("usb phy power on fials");
			return ret;
		}

		usb_power_is_on = true;
	}

	ret = usb_rtk_init();

	usb_dwc2_resize_fifo();

	if (ret) {
		LOG_ERR("usb dw init fials");
		return ret;
	}

#if CONFIG_PM
	usb_register_dlps_cb();
#endif

	usb_dwc2_cfg.irq_enable_func(NULL);

	usb_dwc2_ctrl.attached = 1U;

	return 0;
}

int usb_dc_detach(void)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;

	if (!usb_dwc2_ctrl.attached) {
		return 0;
	}

	irq_disable(DT_INST_IRQ_BY_IDX(0, 0, irq));
	irq_disable(DT_INST_IRQ_BY_IDX(0, 1, irq));

	if (usb_power_is_on) {
		/* Enable soft disconnect */
		base->dctl |= USB_DWC2_DCTL_SFTDISCON;
	}

	usb_rtk_disable_power_seq();
	usb_power_is_on = false;

	usb_dwc2_ctrl.attached = 0U;

	usb_dwc2_ctrl.current_status = USB_DC_DISCONNECTED;
	if (usb_dwc2_ctrl.status_cb) {
		usb_dwc2_ctrl.status_cb(USB_DC_DISCONNECTED, NULL);
	}

	return 0;
}

int usb_dc_reset(void)
{
	int ret;

	ret = usb_dwc2_reset();

	/* Clear private data */
	(void)memset(&usb_dwc2_ctrl, 0, sizeof(usb_dwc2_ctrl));

	return ret;
}

int usb_dc_set_address(const uint8_t addr)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;

#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] %d", __func__, addr);
#endif
	LOG_WRN("usb_dc_set_address %d", addr);

	if (addr > (USB_DWC2_DCFG_DEVADDR_MASK >> USB_DWC2_DCFG_DEVADDR_POS)) {
		return -EINVAL;
	}

	base->dcfg &= ~USB_DWC2_DCFG_DEVADDR_MASK;
	base->dcfg |= addr << USB_DWC2_DCFG_DEVADDR_POS;

	return 0;
}

int usb_dc_ep_check_cap(const struct usb_dc_ep_cfg_data *const cfg)
{
	uint8_t ep_idx = USB_EP_GET_IDX(cfg->ep_addr);

	LOG_DBG("ep %x, mps %d, type %d", cfg->ep_addr, cfg->ep_mps, cfg->ep_type);

	if ((cfg->ep_type == USB_DC_EP_CONTROL) && ep_idx) {
		LOG_ERR("invalid endpoint configuration");
		return -1;
	}

	if (cfg->ep_mps > DW_USB_MAX_PACKET_SIZE) {
		LOG_WRN("unsupported packet size");
		return -1;
	}

	if (USB_EP_DIR_IS_OUT(cfg->ep_addr) && ep_idx >= USB_DWC2_OUT_EP_NUM) {
		LOG_WRN("OUT endpoint address out of range");
		return -1;
	}

	if (USB_EP_DIR_IS_IN(cfg->ep_addr) && ep_idx >= USB_DWC2_IN_EP_NUM) {
		LOG_WRN("IN endpoint address out of range");
		return -1;
	}

	return 0;
}

int usb_dc_ep_configure(const struct usb_dc_ep_cfg_data *const ep_cfg)
{
	uint8_t ep;

	if (!ep_cfg) {
		return -EINVAL;
	}

	ep = ep_cfg->ep_addr;
	LOG_DBG(" ep = 0x%x", ep);
	if (!usb_dwc2_ctrl.attached || !usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	usb_dwc2_ep_set(ep, ep_cfg->ep_mps, ep_cfg->ep_type);

	return 0;
}

int usb_dc_ep_set_stall(const uint8_t ep)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint8_t ep_idx = USB_EP_GET_IDX(ep);

	if (!usb_dwc2_ctrl.attached || !usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	if (USB_EP_DIR_IS_OUT(ep)) {
		base->out_ep[ep_idx].doepctl |= USB_DWC2_DEPCTL_STALL;
	} else {
		base->in_ep[ep_idx].diepctl |= USB_DWC2_DEPCTL_STALL;
	}

	return 0;
}

int usb_dc_ep_clear_stall(const uint8_t ep)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint8_t ep_idx = USB_EP_GET_IDX(ep);

	if (!usb_dwc2_ctrl.attached || !usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	if (!ep_idx) {
		/* Not possible to clear stall for EP0 */
		return -EINVAL;
	}

	if (USB_EP_DIR_IS_OUT(ep)) {
		base->out_ep[ep_idx].doepctl &= ~USB_DWC2_DEPCTL_STALL;
	} else {
		base->in_ep[ep_idx].diepctl &= ~USB_DWC2_DEPCTL_STALL;
	}

	return 0;
}

int usb_dc_ep_halt(const uint8_t ep)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint8_t ep_idx = USB_EP_GET_IDX(ep);
	volatile uint32_t *p_depctl;

	if (!usb_dwc2_ctrl.attached || !usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	if (!ep_idx) {
		/* Cannot disable EP0, just set stall */
		usb_dc_ep_set_stall(ep);
	} else {
		if (USB_EP_DIR_IS_OUT(ep)) {
			p_depctl = &base->out_ep[ep_idx].doepctl;
		} else {
			p_depctl = &base->in_ep[ep_idx].diepctl;
		}

		/* Set STALL and disable endpoint if enabled */
		if (*p_depctl & USB_DWC2_DEPCTL_EPENA) {
			*p_depctl |= USB_DWC2_DEPCTL_EPDIS | USB_DWC2_DEPCTL_STALL;
		} else {
			*p_depctl |= USB_DWC2_DEPCTL_STALL;
		}
	}

	return 0;
}

int usb_dc_ep_is_stalled(const uint8_t ep, uint8_t *const stalled)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint8_t ep_idx = USB_EP_GET_IDX(ep);

	if (!usb_dwc2_ctrl.attached || !usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	if (!stalled) {
		return -EINVAL;
	}

	*stalled = 0U;
	if (USB_EP_DIR_IS_OUT(ep)) {
		if (base->out_ep[ep_idx].doepctl & USB_DWC2_DEPCTL_STALL) {
			*stalled = 1U;
		}
	} else {
		if (base->in_ep[ep_idx].diepctl & USB_DWC2_DEPCTL_STALL) {
			*stalled = 1U;
		}
	}

