zophai-liu/rtk-zephyr/drivers/usb/device/usb_dc_rtl87x2g.c
	return 0;
}

int usb_dc_ep_enable(const uint8_t ep)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint8_t ep_idx = USB_EP_GET_IDX(ep);

	LOG_DBG("ep %x", ep);
	if (!usb_dwc2_ctrl.attached || !usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	/* enable EP interrupts */
	if (USB_EP_DIR_IS_OUT(ep)) {
		base->daintmsk |= USB_DWC2_DAINT_OUTEPINT(ep_idx);
	} else {
		base->daintmsk |= USB_DWC2_DAINT_INEPINT(ep_idx);
	}

	/* Activate Ep */
	if (USB_EP_DIR_IS_OUT(ep)) {
		base->out_ep[ep_idx].doepctl |= USB_DWC2_DEPCTL_USBACTEP;
		usb_dwc2_ctrl.out_ep_ctrl[ep_idx].ep_ena = 1U;
	} else {
		base->in_ep[ep_idx].diepctl |= USB_DWC2_DEPCTL_USBACTEP;
		usb_dwc2_ctrl.in_ep_ctrl[ep_idx].ep_ena = 1U;
	}

#if CONFIG_USB_DC_RTL87X2G_DMA
	if (USB_EP_DIR_IS_OUT(ep)) {
		usb_dwc2_ctrl.aOutXfer[ep_idx] =
			k_heap_alloc(&ep_heap, sizeof(outxfer_t), K_NO_WAIT);
		if (usb_dwc2_ctrl.aOutXfer[ep_idx] == NULL) {
			LOG_ERR("Failed to allocate memory");
			return -ENOMEM;
		}

		usb_dwc2_ctrl.aOutDmaDesc[ep_idx] =
			k_heap_aligned_alloc(&ep_heap, 4, sizeof(OutDmaDesc_t), K_NO_WAIT);
		if (usb_dwc2_ctrl.aOutDmaDesc[ep_idx] == NULL) {
			LOG_ERR("Failed to allocate memory");
			k_heap_free(&ep_heap, usb_dwc2_ctrl.aOutXfer[ep_idx]);
			return -ENOMEM;
		}

		usb_dwc2_ctrl.ep_rx_buf[ep_idx] =
			k_heap_alloc(&ep_heap, usb_dwc2_ctrl.out_ep_ctrl[ep_idx].mps, K_NO_WAIT);
		if (usb_dwc2_ctrl.ep_rx_buf[ep_idx] == NULL) {
			LOG_ERR("Failed to allocate memory");
			k_heap_free(&ep_heap, usb_dwc2_ctrl.aOutXfer[ep_idx]);
			k_heap_free(&ep_heap, usb_dwc2_ctrl.aOutDmaDesc[ep_idx]);
			return -ENOMEM;
		}

	} else {
		usb_dwc2_ctrl.aInXfer[ep_idx] = k_heap_alloc(&ep_heap, sizeof(inxfer_t), K_NO_WAIT);
		if (usb_dwc2_ctrl.aInXfer[ep_idx] == NULL) {
			LOG_ERR("Failed to allocate memory");
			return -ENOMEM;
		}
		usb_dwc2_ctrl.aInDmaDesc[ep_idx] =
			k_heap_aligned_alloc(&ep_heap, 4, sizeof(InDmaDesc_t), K_NO_WAIT);
		if (usb_dwc2_ctrl.aInDmaDesc[ep_idx] == NULL) {
			LOG_ERR("Failed to allocate memory");
			k_heap_free(&ep_heap, usb_dwc2_ctrl.aInXfer[ep_idx]);
			return -ENOMEM;
		}
	}
#endif

	if (USB_EP_DIR_IS_OUT(ep) &&
	    usb_dwc2_ctrl.out_ep_ctrl[ep_idx].cb != usb_transfer_ep_callback) {
		/* Start reading now, except for transfer managed eps */
		usb_dwc2_prep_rx(ep, 0);
	}

	return 0;
}

int usb_dc_ep_disable(const uint8_t ep)
{
	if (!usb_power_is_on) {
		return 0;
	}
	LOG_DBG("line%d", __LINE__);
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint8_t ep_idx = USB_EP_GET_IDX(ep);

#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] ep%x", __func__, ep_idx);
#endif

	if (!usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	/* Disable EP interrupts */
	if (USB_EP_DIR_IS_OUT(ep)) {
		base->daintmsk &= ~USB_DWC2_DAINT_OUTEPINT(ep_idx);
		base->doepmsk &= USB_DWC2_DOEPINT_SETUP;
	} else {
		base->daintmsk &= ~USB_DWC2_DAINT_INEPINT(ep_idx);
		base->diepmsk &= USB_DWC2_DIEPINT_XFERCOMPL;
		base->gintmsk &= USB_DWC2_GINTSTS_RXFLVL;
	}

	/* De-activate, disable and set NAK for Ep */
	if (USB_EP_DIR_IS_OUT(ep)) {
		base->out_ep[ep_idx].doepctl &=
			~(USB_DWC2_DEPCTL_USBACTEP | USB_DWC2_DEPCTL_EPENA | USB_DWC2_DEPCTL_SNAK);
		usb_dwc2_ctrl.out_ep_ctrl[ep_idx].ep_ena = 0U;
	} else {
		base->in_ep[ep_idx].diepctl &=
			~(USB_DWC2_DEPCTL_USBACTEP | USB_DWC2_DEPCTL_EPENA | USB_DWC2_DEPCTL_SNAK);
		usb_dwc2_ctrl.in_ep_ctrl[ep_idx].ep_ena = 0U;
	}

#if CONFIG_USB_DC_RTL87X2G_DMA
	if (USB_EP_DIR_IS_OUT(ep)) {
		k_heap_free(&ep_heap, usb_dwc2_ctrl.aOutXfer[ep_idx]);
		k_heap_free(&ep_heap, usb_dwc2_ctrl.aOutDmaDesc[ep_idx]);
		k_heap_free(&ep_heap, usb_dwc2_ctrl.ep_rx_buf[ep_idx]);
	} else {
		k_heap_free(&ep_heap, usb_dwc2_ctrl.aInXfer[ep_idx]);
		k_heap_free(&ep_heap, usb_dwc2_ctrl.aInDmaDesc[ep_idx]);
	}
#endif

	return 0;
}

int usb_dc_ep_flush(const uint8_t ep)
{
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint8_t ep_idx = USB_EP_GET_IDX(ep);
	uint32_t cnt;

	if (!usb_dwc2_ctrl.attached || !usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	if (USB_EP_DIR_IS_OUT(ep)) {
		/* RX FIFO is global and cannot be flushed per EP */
		return -EINVAL;
	}

	/* Each endpoint has dedicated Tx FIFO */
	base->grstctl |= ep_idx << USB_DWC2_GRSTCTL_TXFNUM_POS;
	base->grstctl |= USB_DWC2_GRSTCTL_TXFFLSH;

	cnt = 0U;

	do {
		if (++cnt > USB_DWC2_CORE_RST_TIMEOUT_US) {
			LOG_ERR("USB TX FIFO flush HANG!");
			return -EIO;
		}
		usb_dwc2_udelay(1);
	} while (base->grstctl & USB_DWC2_GRSTCTL_TXFFLSH);

	return 0;
}

int usb_dc_ep_write(const uint8_t ep, const uint8_t *const data, const uint32_t data_len,
		    uint32_t *const ret_bytes)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] ep%x data_len=%d", __func__, ep, data_len);
#endif
	int ret;

	if (!usb_dwc2_ctrl.attached || !usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	/* Check if IN ep */
	if (USB_EP_GET_DIR(ep) != USB_EP_DIR_IN) {
		return -EINVAL;
	}

	/* Check if ep enabled */
	if (!usb_dwc2_ep_is_enabled(ep)) {
		return -EINVAL;
	}

#if CONFIG_USB_DC_RTL87X2G_DMA
	ret = usb_dwc2_tx_dma(ep, data, data_len);
#else
	ret = usb_dwc2_tx(ep, data, data_len);
#endif

	if (ret < 0) {
		return ret;
	}

	if (ret_bytes) {
		*ret_bytes = ret;
	}

	return 0;
}

int usb_dc_ep_read_wait(uint8_t ep, uint8_t *data, uint32_t max_data_len, uint32_t *read_bytes)
{
#if CONFIG_USB_DC_RTL87X2G_DMA
	uint8_t ep_idx = USB_EP_GET_IDX(ep);

	if (data) {
		memcpy(data, usb_dwc2_ctrl.ep_rx_buf[ep_idx], max_data_len);
		return 0;
	} else {
		return -EINVAL;
	}
#else

	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;
	uint8_t ep_idx = USB_EP_GET_IDX(ep);
	uint32_t i, j, data_len, bytes_to_copy;

	if (!usb_dwc2_ctrl.attached || !usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	/* Check if OUT ep */
	if (USB_EP_GET_DIR(ep) != USB_EP_DIR_OUT) {
		LOG_ERR("Wrong endpoint direction");
		return -EINVAL;
	}

	/* Allow to read 0 bytes */
	if (!data && max_data_len) {
		LOG_ERR("Wrong arguments");
		return -EINVAL;
	}

