zophai-liu/rtk-zephyr/drivers/usb/device/usb_dc_rtl87x2g.c
	/* Check if ep enabled */
	if (!usb_dwc2_ep_is_enabled(ep)) {
		LOG_ERR("Not enabled endpoint");
		return -EINVAL;
	}

	data_len = usb_dwc2_ctrl.out_ep_ctrl[ep_idx].data_len;

	if (!data && !max_data_len) {
		/* When both buffer and max data to read are zero return
		 * the available data in buffer
		 */
		if (read_bytes) {
			*read_bytes = data_len;
		}
		return 0;
	}

	if (data_len > max_data_len) {
		LOG_ERR("Not enough room to copy all the rcvd data!");
		bytes_to_copy = max_data_len;
	} else {
		bytes_to_copy = data_len;
	}

	LOG_DBG("Read EP%d, req %d, read %d bytes", ep, max_data_len, bytes_to_copy);

	/* Data in the FIFOs is always stored per 32-bit words */
	for (i = 0U; i < (bytes_to_copy & ~0x3); i += 4U) {
		*(uint32_t *)(data + i) = USB_DWC2_EP_FIFO(base, ep_idx);
	}
	if (bytes_to_copy & 0x3) {
		/* Not multiple of 4 */
		uint32_t last_dw = USB_DWC2_EP_FIFO(base, ep_idx);

		for (j = 0U; j < (bytes_to_copy & 0x3); j++) {
			*(data + i + j) = (sys_cpu_to_le32(last_dw) >> (j * 8U)) & 0xFF;
		}
	}

	usb_dwc2_ctrl.out_ep_ctrl[ep_idx].data_len -= bytes_to_copy;

	if (read_bytes) {
		*read_bytes = bytes_to_copy;
	}

	return 0;
#endif
}

int usb_dc_ep_read_continue(uint8_t ep)
{
	uint8_t ep_idx = USB_EP_GET_IDX(ep);

	if (!usb_dwc2_ctrl.attached || !usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	/* Check if OUT ep */
	if (USB_EP_GET_DIR(ep) != USB_EP_DIR_OUT) {
		LOG_ERR("Wrong endpoint direction");
		return -EINVAL;
	}

	if (!usb_dwc2_ctrl.out_ep_ctrl[ep_idx].data_len) {
		usb_dwc2_prep_rx(ep_idx, 0);
	}

	return 0;
}

int usb_dc_ep_read(const uint8_t ep, uint8_t *const data, const uint32_t max_data_len,
		   uint32_t *const read_bytes)
{
	if (usb_dc_ep_read_wait(ep, data, max_data_len, read_bytes) != 0) {
		return -EINVAL;
	}

	if (!data && !max_data_len) {
		/* When both buffer and max data to read are zero the above
		 * call would fetch the data len and we simply return.
		 */
		return 0;
	}

	if (usb_dc_ep_read_continue(ep) != 0) {
		return -EINVAL;
	}

	return 0;
}

int usb_dc_ep_set_callback(const uint8_t ep, const usb_dc_ep_callback cb)
{
	uint8_t ep_idx = USB_EP_GET_IDX(ep);

	if (!usb_dwc2_ctrl.attached || !usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	if (USB_EP_DIR_IS_IN(ep)) {
		usb_dwc2_ctrl.in_ep_ctrl[ep_idx].cb = cb;
	} else {
		usb_dwc2_ctrl.out_ep_ctrl[ep_idx].cb = cb;
	}

	return 0;
}

void usb_dc_set_status_callback(const usb_dc_status_callback cb)
{
	usb_dwc2_ctrl.status_cb = cb;
}

int usb_dc_ep_mps(const uint8_t ep)
{
	enum usb_dwc2_out_ep_idx ep_idx = USB_EP_GET_IDX(ep);

	if (!usb_dwc2_ctrl.attached || !usb_dwc2_ep_is_valid(ep)) {
		LOG_ERR("Not attached / Invalid endpoint: EP 0x%x", ep);
		return -EINVAL;
	}

	if (USB_EP_DIR_IS_OUT(ep)) {
		return usb_dwc2_ctrl.out_ep_ctrl[ep_idx].mps;
	} else {
		return usb_dwc2_ctrl.in_ep_ctrl[ep_idx].mps;
	}
}

int usb_dc_wakeup_request(void)
{
	usb_rtk_resume_sequence();
	SoC_VENDOR->u_004.REG_LOW_PRI_INT_STATUS |= BIT31;
	struct usb_dwc2_reg *const base = usb_dwc2_cfg.base;

	if (!(base->dsts & BIT0)) {
		LOG_ERR("Remote wakeup while is not in suspend state, or while is not allowed by "
			"host.");
		return -EAGAIN;
	}

	base->dctl |= USB_DWC2_DCTL_RMTWKUPSIG;

	k_sleep(K_MSEC(2));

	base->dctl &= ~USB_DWC2_DCTL_RMTWKUPSIG;

	LOG_DBG("Remote wakeup from suspend.");

	return 0;
}

static void usb_isr_suspend_enable(void)
{
#ifdef CONFIG_PM
	AON_REG7X_SYS_TYPE reg7x;

	reg7x.d32 = HAL_READ32(SYSTEM_REG_BASE, AON_REG7X_SYS);
	reg7x.usb_wakeup_sel = 1;
	reg7x.USB_WKPOL = 0;
	reg7x.USB_WKEN = 1;
	HAL_WRITE32(SYSTEM_REG_BASE, AON_REG7X_SYS, reg7x.d32);
#endif

	/* edge trigger */
	SoC_VENDOR->u_008.REG_LOW_PRI_INT_MODE |= BIT31;

	/* resing edge trigger */
	SoC_VENDOR->u_018.INTERRUPT_EDGE_OPTION &= ~(BIT31);

	/* Note: must disable at disable flow */
	SoC_VENDOR->u_00C.REG_LOW_PRI_INT_EN |= BIT31;
}

#ifdef CONFIG_PM
extern int hal_usb_wakeup_status_clear(void);
extern int hal_usb_wakeup_status_get(void);
extern void usb_set_pon_domain(void);
extern void usb_dm_start_from_dlps(void);

void usb_start_from_dlps(void)
{
	if (usb_rtk_resume_sequence() != 0) {
		usb_rtk_disable_power_seq();
		return;
	}

	usb_dwc2_cfg.irq_enable_func(NULL);

	return;
}

static PMCheckResult usb_pm_check(void)
{
	volatile enum usb_dc_status_code usb_state = usb_dwc2_ctrl.current_status;

	if (usb_state == USB_DC_SUSPEND || usb_state == USB_DC_DISCONNECTED) {
		return PM_CHECK_PASS;
	} else {
		return PM_CHECK_FAIL;
	}
}

static void usb_pm_store(void)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("======================usb_pm_store======================");
#endif
	hal_usb_wakeup_status_clear();
	AON_REG8X_SYS_TYPE reg8x;

	reg8x.d32 = AON_REG_READ(AON_REG8X_SYS);
}

static void usb_pm_restore(void)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("======================usb_pm_restore======================");
#endif
	if (hal_usb_wakeup_status_get() == 0) {
	} else {
		usb_start_from_dlps();
	}
}

static void usb_register_dlps_cb(void)
{
	usb_set_pon_domain();

	platform_pm_register_callback_func_with_priority((void *)usb_pm_check, PLATFORM_PM_CHECK,
							 1);
	platform_pm_register_callback_func_with_priority((void *)usb_pm_store, PLATFORM_PM_STORE,
							 1);
	platform_pm_register_callback_func_with_priority((void *)usb_pm_restore,
							 PLATFORM_PM_RESTORE, 1);
}
#endif
